# ContinuousFootingBreakAtInsertsDisable Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..ContinuousFootingBreakAtInsertsDisable Property
ParameterTypeId Class See Also
---
"Do Not Break At Inserts"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId ContinuousFootingBreakAtInsertsDisable { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ContinuousFootingBreakAtInsertsDisable As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ ContinuousFootingBreakAtInsertsDisable {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace